In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        'English':[45,90,34],
        'Maths':[67,99,15],
        'Science':[64,68,11]
    }
)
df

   English  Maths  Science
0       45     67       64
1       90     99       68
2       34     15       11

Aggregate these functions over the rows.

In [6]:
df.agg(['min','max'])

     English  Maths  Science
min       34     15       11
max       90     99       68

Different aggregations per column.

In [8]:
# Applied to all the column, same as axis=0
df.agg(
    {
        'Maths':['max','min','mean'],
        'Science':['max','min']
    }
)

          Maths  Science
max   99.000000     68.0
min   15.000000     11.0
mean  60.333333      NaN

In [7]:
# Applied to all the rowise, same as axis=1
df.agg("max", axis="columns")

0    67
1    99
2    34
dtype: int64